<?php
if (isset($_POST['DepartmentCode'])) {
    $DepartmentCode = $_POST['DepartmentCode'];
    // แมปรหัสแผนกกับชื่อแผนก
    $departmentDescriptions = [
        "001" => "อายุรกรรมชั้น 2",
        "002" => "Napha Clinic",
        "003" => "ผิวหนังชั้น 2",
        "004" => "วัณโรค",
        "005" => "เบาหวาน",
        "007" => "โรคทั่วไป",
        "008" => "ฟอกไต",
        "011" => "ศัลยกรรม",
        "012" => "ศัลยกรรมประสาท",
        "013" => "ศัลยกรรมระบบทางเดินปัสสาวะ",
        "016" => "",
        "018" => "นรีเวช",
        "019" => "วัยทอง",
        "020" => "กุมารเวชกรรม",
        "024" => "หู คอ จมูก",
        "026" => "ตา",
        "028" => "ศัลยกรรมกระดูก",
        "030" => "จิตเวช",
        "043" => "ห้องฉีดยา",
        "045" => "ฝากครรถ์",
        "051" => "วางแผนครอบครัว",
        "059" => "คลินิกผู้สูงอายุ",
        "073" => "ตรวจพิเศษ",
        "078" => "กายภาพบำบัด",
        "080" => "ห้องทำแผล",
        "081" => "กายอุปกรณ์",        
        "087" => "เวชปฏิบัติ",
        "092" => "อุบัติเหตุหมู่",
        "121" => "งานสวัสดิการสังคม",
        "125" => "กลุ่มงานเวชกรรมสังคม",
        "126" => "เวชระเบียนผู้ป่วยนอก",
        "133" => "Admit Center",
        "147" => "โรคถุงลมโปร่งพองเรื้อรัง (COPD)",
        "149" => "โรคหลอดเลือดสมอง(STROKE)",
        "155" => "คลินิกหัวใจชั้น2",
        "160" => "PM&R (ฟื้นฟู)",
        "162" => "Clinic CKD",
        "164" => "ศัลยกรรม-ESWL",
        "171" => "กิจกรรมบำบัด",
        "175" => "PFT CLINIC ชั้น 2",
        "206" => "CAPD Clinic",
        "268" => "Palliative_Care",
        "398" => "COVID CLINIC",
        "404" => "ห้องให้เลือด",
        "405" => "PLASTIC",
        "408" => "PREANESTHESIA",
        "421" => "ศัลยกรรมเด็ก",
        "422" => "อายุรกรรมระบบประสาท",
        "423" => "คลินิกโรคต่อมไร้ท่อ",
        "426" => "ONCO",
        "440" => "ห้องนัดผ่าตัดใหญ่"
    ];
$selectedDepartmentDescription = isset($departmentDescriptions[$DepartmentCode]) ? $departmentDescriptions[$DepartmentCode] : "ไม่ระบุแผนก";
} else {
    $DepartmentCode = 'ไม่ระบุ';
    $selectedDepartmentDescription = "ไม่ระบุแผนก";
}
?>